Revit 2027 API
ExtendedPropertiesBindingType Enumeration
 Enumeration type to indicate whether extended properties should be bound to instances or types.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExtendedPropertiesBindingType
Public Enumeration ExtendedPropertiesBindingType
public enum class ExtendedPropertiesBindingType
type ExtendedPropertiesBindingType
Members
Member name | Value | Description
Instance | 0 |  Extended properties should be bound to instance.
Type | 1 |  Extended properties should be bound to type.
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace